Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_DCDC.h
#define DCDC_REG3_REG_FBK_SEL_MASK               (0xC00000U)
#define DCDC_REG3_REG_FBK_SEL_SHIFT              (22U)
#define DCDC_REG3_REG_FBK_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_REG_FBK_SEL_SHIFT)) & DCDC_REG3_REG_FBK_SEL_MASK)

#define DCDC_REG3_MINPWR_DC_HALFCLK_MASK         (0x1000000U)
#define DCDC_REG3_MINPWR_DC_HALFCLK_SHIFT        (24U)
/*! MINPWR_DC_HALFCLK
 *  0b0..DCDC clock remains at full frequency for continuous mode
 *  0b1..DCDC clock set to half frequency for continuous mode
 */
#define DCDC_REG3_MINPWR_DC_HALFCLK(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_MINPWR_DC_HALFCLK_SHIFT)) & DCDC_REG3_MINPWR_DC_HALFCLK_MASK)

#define DCDC_REG3_MINPWR_HALF_FETS_MASK          (0x4000000U)
#define DCDC_REG3_MINPWR_HALF_FETS_SHIFT         (26U)
#define DCDC_REG3_MINPWR_HALF_FETS(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_MINPWR_HALF_FETS_SHIFT)) & DCDC_REG3_MINPWR_HALF_FETS_MASK)

#define DCDC_REG3_MISC_DELAY_TIMING_MASK         (0x8000000U)
#define DCDC_REG3_MISC_DELAY_TIMING_SHIFT        (27U)
/*! MISC_DELAY_TIMING - Miscellaneous Delay Timing */
#define DCDC_REG3_MISC_DELAY_TIMING(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_MISC_DELAY_TIMING_SHIFT)) & DCDC_REG3_MISC_DELAY_TIMING_MASK)

#define DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK   (0x20000000U)
#define DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_SHIFT  (29U)
/*! VDD1P0CTRL_DISABLE_STEP - Disable Step for VDD1P0
 *  0b0..Enable stepping for VDD1P0
 *  0b1..Disable stepping for VDD1P0
 */
#define DCDC_REG3_VDD1P0CTRL_DISABLE_STEP(x)     (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_SHIFT)) & DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK)

#define DCDC_REG3_VDD1P8CTRL_DISABLE_STEP_MASK   (0x40000000U)
#define DCDC_REG3_VDD1P8CTRL_DISABLE_STEP_SHIFT  (30U)
/*! VDD1P8CTRL_DISABLE_STEP - Disable Step for VDD1P8
 *  0b0..Enable stepping for VDD1P8
 *  0b1..Disable stepping for VDD1P8
 */
#define DCDC_REG3_VDD1P8CTRL_DISABLE_STEP(x)     (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_VDD1P8CTRL_DISABLE_STEP_SHIFT)) & DCDC_REG3_VDD1P8CTRL_DISABLE_STEP_MASK)
/*! @} */

/*! @name REG4 - DCDC Register 4 */
/*! @{ */

#define DCDC_REG4_ENABLE_SP_MASK                 (0xFFFFU)
#define DCDC_REG4_ENABLE_SP_SHIFT                (0U)
#define DCDC_REG4_ENABLE_SP(x)                   (((uint32_t)(((uint32_t)(x)) << DCDC_REG4_ENABLE_SP_SHIFT)) & DCDC_REG4_ENABLE_SP_MASK)
/*! @} */

/*! @name REG5 - DCDC Register 5 */
/*! @{ */

#define DCDC_REG5_DIG_EN_SP_MASK                 (0xFFFFU)
#define DCDC_REG5_DIG_EN_SP_SHIFT                (0U)
#define DCDC_REG5_DIG_EN_SP(x)                   (((uint32_t)(((uint32_t)(x)) << DCDC_REG5_DIG_EN_SP_SHIFT)) & DCDC_REG5_DIG_EN_SP_MASK)
/*! @} */

/*! @name REG6 - DCDC Register 6 */
/*! @{ */

#define DCDC_REG6_LP_MODE_SP_MASK                (0xFFFFU)
#define DCDC_REG6_LP_MODE_SP_SHIFT               (0U)
#define DCDC_REG6_LP_MODE_SP(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_REG6_LP_MODE_SP_SHIFT)) & DCDC_REG6_LP_MODE_SP_MASK)
/*! @} */

/*! @name REG7 - DCDC Register 7 */
/*! @{ */

#define DCDC_REG7_STBY_EN_SP_MASK                (0xFFFFU)
#define DCDC_REG7_STBY_EN_SP_SHIFT               (0U)
#define DCDC_REG7_STBY_EN_SP(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_REG7_STBY_EN_SP_SHIFT)) & DCDC_REG7_STBY_EN_SP_MASK)
/*! @} */

/*! @name REG7P - DCDC Register 7 plus */
/*! @{ */

#define DCDC_REG7P_STBY_LP_MODE_SP_MASK          (0xFFFFU)
#define DCDC_REG7P_STBY_LP_MODE_SP_SHIFT         (0U)
#define DCDC_REG7P_STBY_LP_MODE_SP(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_REG7P_STBY_LP_MODE_SP_SHIFT)) & DCDC_REG7P_STBY_LP_MODE_SP_MASK)
/*! @} */

/*! @name REG8 - DCDC Register 8 */
/*! @{ */

#define DCDC_REG8_ANA_TRG_SP0_MASK               (0xFFFFFFFFU)
#define DCDC_REG8_ANA_TRG_SP0_SHIFT              (0U)
#define DCDC_REG8_ANA_TRG_SP0(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_REG8_ANA_TRG_SP0_SHIFT)) & DCDC_REG8_ANA_TRG_SP0_MASK)
/*! @} */

/*! @name REG9 - DCDC Register 9 */
/*! @{ */

#define DCDC_REG9_ANA_TRG_SP1_MASK               (0xFFFFFFFFU)
#define DCDC_REG9_ANA_TRG_SP1_SHIFT              (0U)
#define DCDC_REG9_ANA_TRG_SP1(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_REG9_ANA_TRG_SP1_SHIFT)) & DCDC_REG9_ANA_TRG_SP1_MASK)
/*! @} */

/*! @name REG10 - DCDC Register 10 */
/*! @{ */

#define DCDC_REG10_ANA_TRG_SP2_MASK              (0xFFFFFFFFU)
#define DCDC_REG10_ANA_TRG_SP2_SHIFT             (0U)
#define DCDC_REG10_ANA_TRG_SP2(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG10_ANA_TRG_SP2_SHIFT)) & DCDC_REG10_ANA_TRG_SP2_MASK)
/*! @} */

/*! @name REG11 - DCDC Register 11 */
/*! @{ */

#define DCDC_REG11_ANA_TRG_SP3_MASK              (0xFFFFFFFFU)
#define DCDC_REG11_ANA_TRG_SP3_SHIFT             (0U)
#define DCDC_REG11_ANA_TRG_SP3(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG11_ANA_TRG_SP3_SHIFT)) & DCDC_REG11_ANA_TRG_SP3_MASK)
/*! @} */

/*! @name REG12 - DCDC Register 12 */
/*! @{ */

#define DCDC_REG12_DIG_TRG_SP0_MASK              (0xFFFFFFFFU)
#define DCDC_REG12_DIG_TRG_SP0_SHIFT             (0U)
#define DCDC_REG12_DIG_TRG_SP0(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG12_DIG_TRG_SP0_SHIFT)) & DCDC_REG12_DIG_TRG_SP0_MASK)
/*! @} */

/*! @name REG13 - DCDC Register 13 */
/*! @{ */

#define DCDC_REG13_DIG_TRG_SP1_MASK              (0xFFFFFFFFU)
#define DCDC_REG13_DIG_TRG_SP1_SHIFT             (0U)
#define DCDC_REG13_DIG_TRG_SP1(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG13_DIG_TRG_SP1_SHIFT)) & DCDC_REG13_DIG_TRG_SP1_MASK)
/*! @} */

/*! @name REG14 - DCDC Register 14 */
/*! @{ */

#define DCDC_REG14_DIG_TRG_SP2_MASK              (0xFFFFFFFFU)
#define DCDC_REG14_DIG_TRG_SP2_SHIFT             (0U)
#define DCDC_REG14_DIG_TRG_SP2(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG14_DIG_TRG_SP2_SHIFT)) & DCDC_REG14_DIG_TRG_SP2_MASK)
/*! @} */

/*! @name REG15 - DCDC Register 15 */
/*! @{ */

#define DCDC_REG15_DIG_TRG_SP3_MASK              (0xFFFFFFFFU)
#define DCDC_REG15_DIG_TRG_SP3_SHIFT             (0U)
#define DCDC_REG15_DIG_TRG_SP3(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG15_DIG_TRG_SP3_SHIFT)) & DCDC_REG15_DIG_TRG_SP3_MASK)
/*! @} */

/*! @name REG16 - DCDC Register 16 */
/*! @{ */

